## *Concatenate*

**Concatenating two series with default parameters**

In [7]:
import pandas as pd

In [8]:
ser1 = pd.Series([1,5,6],index=[0,2,3])
ser2 = pd.Series([5,3,9],index=['A','B','C'])
ser3 = pd.concat([ser1,ser2])
display(ser3)

0    1
2    5
3    6
A    5
B    3
C    9
dtype: int64

**Pandas combining two dataframes horizontally with index = 1**

Two Pandas Series (series1 and series2), and then concatenates them along the columns (axis=1) using pd.concat(). The resulting DataFrame contains both Series as columns, creating a new DataFrame with two columns.

In [105]:
ser1 = pd.Series([5,6,8])
ser2 = pd.Series([8,3,9])
df = pd.concat([ser1,ser2],axis =1)
display(df)

   0  1
0  5  8
1  6  3
2  8  9

**Concatenating 2 DataFrames and Assigning Keys**

Creates two DataFrames (df1 and df2), and concatenates them along with keys assigned to each DataFrame using pd.concat(). The resulting DataFrame has a hierarchical index with keys ‘key1’ and ‘key2’, distinguishing the origin of each set of data.

In [129]:
df1 = pd.DataFrame({'A0':[5,6,9],
                   'B0':[1,1,1]})
df2 = pd.DataFrame({'A0':[4,6,8,9],
                   'B0':[2,1,8,6]})
display(df1)
display(df2)

df3 = pd.concat([df1,df2],keys = ['2008','Value2'])
display(df3)

   A0  B0
0   5   1
1   6   1
2   9   1

   A0  B0
0   4   2
1   6   1
2   8   8
3   9   6

          A0  B0
2008   0   5   1
       1   6   1
       2   9   1
Value2 0   4   2
       1   6   1
       2   8   8
       3   9   6

**Concatenating DataFrames horizontally in Pandas with axis = 1**

Creates two DataFrames (df1 and df2), and concatenates them along the columns (axis=1) using pd.concat(). The resulting DataFrame combines columns from both df1 and df2, aligning them side by side.

In [113]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
display(df1)
df2 = pd.DataFrame({'C': ['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
display(df2)
display(pd.concat([df1,df2],axis = 1))

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

**Concatenating 2 DataFrames with ignore_index = True**

Creates two DataFrames (df1 and df2) with identical columns, and concatenates them vertically using pd.concat() with ignore_index=True. The resulting DataFrame has a continuous index, ignoring the original indices of df1 and df2.

In [119]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
					'B': ['B0', 'B1', 'B2', 'B3']})
display('df1:', df1)
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 
					'B': ['B4', 'B5', 'B6', 'B7']})
display('df2:', df2)
display(pd.concat([df1,df2], ignore_index = True))

'df1:'

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

'df2:'

    A   B
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5
6  A6  B6
7  A7  B7

## Concatenating a DataFrame with a Series

Creates a DataFrame (df) and a Series (series), then concatenates them along the columns (axis=1) using pd.concat(). The resulting DataFrame combines the columns from df and the Series, aligning them side by side. Note: There’s a typo in the display statement (df1 instead of df).

In [58]:
df = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
					'B': ['B0', 'B1', 'B2', 'B3']})
ser = pd.Series([1,5,6,5])
display(pd.concat([df,ser],axis = 1))

    A   B  0
0  A0  B0  1
1  A1  B1  5
2  A2  B2  6
3  A3  B3  5